## Carga de datos a MySQL desde Python

Notebook utilizada para subir los datos en el archivo 'datos_2.csv' a MongoDB.

In [1]:
import mysql.connector
import pandas as pd
from datetime import datetime
import time

In [2]:
host_ = 'localhost'
user_ = 'data'
password_ = 'data'

In [3]:
conn = mysql.connector.connect(host=host_, user=user_,  
                        password=password_, database='METEO')
conn.autocommit = True
cursor = conn.cursor(buffered=True)

In [4]:
df = pd.read_csv('datos_2.csv')
df.head()

   fila               Fechas  Lat  Lon      Prep        Temp           Pres
0     9  1979-01-01 08:00:00  -26  -64  0.000184  300.325340  100769.209949
1     8  1979-01-01 08:00:00  -26  -63  0.000798  300.693421  100727.754873
2     7  1979-01-01 08:00:00  -26  -62  0.000042  300.606683  100705.300040
3     6  1979-01-01 08:00:00  -26  -61  0.000143  300.454335  100688.498172
4     5  1979-01-01 08:00:00  -26  -60  0.000017  300.141855  100688.969252

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 177228 entries, 0 to 177227
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   fila    177228 non-null  int64
 1   Fechas  177228 non-null  object
 2   Lat     177228 non-null  int64
 3   Lon     177228 non-null  int64
 4   Prep    177228 non-null  float64
 5   Temp    177228 non-null  float64
 6   Pres    177228 non-null  float64
dtypes: float64(3), int64(3), object(1)
memory usage: 9.5+ MB

In [6]:
sql100 = "CREATE TABLE INFO_METEO (Estaciones FLOAT NOT NULL,Fechas DATETIME NOT NULL, latitud FLOAT NOT NULL,longitud FLOAT NOT NULL, precipitacion FLOAT NOT NULL, temperatura FLOAT NOT NULL,presion FLOAT NOT NULL);"
cursor.execute(sql100)
print("the table is created....")

the table is created....

In [8]:
t11 = datetime.now()
for i,row in df.iterrows():
    sql = "INSERT INTO METEO.INFO_METEO VALUES (%s,%s,%s,%s,%s,%s,%s)"
    cursor.execute(sql, tuple(row))
t22 = datetime.now()

In [9]:
delta_t = t22-t11
print('Tiempo en cargar los datos:',delta_t)

Tiempo en cargar los datos: 0:25:53.107448

In [11]:
sql3 = "select count(*) from INFO_METEO"
cursor.execute(sql3)
result = cursor.fetchall()
for i in result:
    print(i)

(177228,)